package com.example.a81_lifecycle

class BodyType {
    val textSlender = "Норма"
    val textFull = "Избыточный вес\n" +
            "\n Избыточный вес говорит о необходимости коррекции. В противном случае есть риск развития гипертонии, болезней сердца, сахарного диабета.\n" +
            "Как бороться?\n" +
            "Иногда достаточно скорректировать образ жизни, питание:\n" +
            "отказаться от любого алкоголя;\n" +
            "увеличить потребление фруктов, овощей;\n" +
            "уменьшить количество калорий;\n" +
            "заниматься спортом минимум 150 минут в неделю.\n" +
            "Поддерживать организм в тонусе помогают зеленые, травяные чаи, цитрусовые фрукты, кисломолочные продукты жирностью не более 2,5%.\n"
    val textThin = "Дефицит.\n" +
            "\nДефицит массы тела влечет за собой:" +
            "\nхрупкость костей," +
            "\nу женщин — аменорею, анорексию;" +
            "\nизменение гормонального фона;" +
            "\nнедостаточную выработку желчи, из-за чего пища хуже переваривается, усваивается." +
            "\nКак бороться?" +
            "\nЕдинственный способ поправиться — больше кушать. Наращивать объемы лучше с добавлением в рацион высококалорийных продуктов — орехов, сложных углеводов, молока, кефира, творога. Для поднятия веса лучше прибегать к силовым тренировкам." +
            "\nЭффективным будет добавление витаминов и БАДов. Однако важно проконсультироваться с лечащим врачом, чтобы он определил, каких именно полезных веществ не хватает организму. Безопасный и быстрый способ повысить вес — прием пивных дрожжей. Для улучшения пищеварения врач может порекомендовать пробиотики.\n"
}